title: Suspicious Encoded PowerShell Command
id: 22222222-2222-2222-2222-222222222222
status: experimental
description: Detects encoded PowerShell execution which may indicate obfuscation.
author: Omotara100
date: 2025-04-01

logsource:
  product: windows
  service: sysmon

detection:
  selection:
    EventID: 1
    Image|endswith: powershell.exe
    CommandLine|contains: "-enc"
  condition: selection

falsepositives:
  - Legitimate administrative scripts

level: high

tags:
  - attack.execution
  - attack.t1059.001

